origin_redis/redis/bench-results/fs_redis_fdp_disabled_everysec/0/summary_5.txt
====== SET ======
  28835840 requests completed in 624.46 seconds
  50 parallel clients
  4096 bytes payload
  keep alive: 1
  host configuration "save": 
  host configuration "appendonly": yes
  multi-thread: no

Latency by percentile distribution:
0.000% <= 0.143 milliseconds (cumulative count 1)
50.000% <= 0.815 milliseconds (cumulative count 14520186)
75.000% <= 1.031 milliseconds (cumulative count 21793109)
87.500% <= 1.199 milliseconds (cumulative count 25256332)
93.750% <= 1.351 milliseconds (cumulative count 27080225)
96.875% <= 1.495 milliseconds (cumulative count 27942645)
98.438% <= 1.639 milliseconds (cumulative count 28389764)
99.219% <= 1.823 milliseconds (cumulative count 28613200)
99.609% <= 2.071 milliseconds (cumulative count 28723723)
99.805% <= 2.623 milliseconds (cumulative count 28779802)
99.902% <= 20.703 milliseconds (cumulative count 28807693)
99.951% <= 39.647 milliseconds (cumulative count 28821772)
99.976% <= 85.567 milliseconds (cumulative count 28828810)
99.988% <= 200.319 milliseconds (cumulative count 28832325)
99.994% <= 255.999 milliseconds (cumulative count 28834103)
99.997% <= 455.423 milliseconds (cumulative count 28834962)
99.998% <= 495.359 milliseconds (cumulative count 28835409)
99.999% <= 510.207 milliseconds (cumulative count 28835624)
100.000% <= 1055.743 milliseconds (cumulative count 28835735)
100.000% <= 6742.015 milliseconds (cumulative count 28835790)
100.000% <= 6926.335 milliseconds (cumulative count 28835840)
100.000% <= 6926.335 milliseconds (cumulative count 28835840)

Cumulative distribution of latencies:
0.000% <= 0.103 milliseconds (cumulative count 0)
0.001% <= 0.207 milliseconds (cumulative count 400)
0.214% <= 0.303 milliseconds (cumulative count 61804)
2.359% <= 0.407 milliseconds (cumulative count 680332)
9.341% <= 0.503 milliseconds (cumulative count 2693574)
20.136% <= 0.607 milliseconds (cumulative count 5806350)
33.403% <= 0.703 milliseconds (cumulative count 9631940)
49.216% <= 0.807 milliseconds (cumulative count 14191958)
61.843% <= 0.903 milliseconds (cumulative count 17833010)
73.355% <= 1.007 milliseconds (cumulative count 21152549)
81.424% <= 1.103 milliseconds (cumulative count 23479211)
88.022% <= 1.207 milliseconds (cumulative count 25382014)
92.356% <= 1.303 milliseconds (cumulative count 26631525)
95.311% <= 1.407 milliseconds (cumulative count 27483753)
97.021% <= 1.503 milliseconds (cumulative count 27976836)
98.213% <= 1.607 milliseconds (cumulative count 28320508)
98.815% <= 1.703 milliseconds (cumulative count 28494133)
99.186% <= 1.807 milliseconds (cumulative count 28601064)
99.398% <= 1.903 milliseconds (cumulative count 28662371)
99.548% <= 2.007 milliseconds (cumulative count 28705441)
99.636% <= 2.103 milliseconds (cumulative count 28730982)
99.848% <= 3.103 milliseconds (cumulative count 28792044)
99.870% <= 4.103 milliseconds (cumulative count 28798371)
99.874% <= 5.103 milliseconds (cumulative count 28799385)
99.875% <= 6.103 milliseconds (cumulative count 28799674)
99.875% <= 7.103 milliseconds (cumulative count 28799849)
99.875% <= 8.103 milliseconds (cumulative count 28799871)
99.876% <= 9.103 milliseconds (cumulative count 28799951)
99.876% <= 10.103 milliseconds (cumulative count 28799962)
99.876% <= 12.103 milliseconds (cumulative count 28800012)
99.876% <= 13.103 milliseconds (cumulative count 28800158)
99.877% <= 14.103 milliseconds (cumulative count 28800243)
99.878% <= 15.103 milliseconds (cumulative count 28800697)
99.881% <= 16.103 milliseconds (cumulative count 28801464)
99.885% <= 17.103 milliseconds (cumulative count 28802704)
99.890% <= 18.111 milliseconds (cumulative count 28804194)
99.894% <= 19.103 milliseconds (cumulative count 28805383)
99.899% <= 20.111 milliseconds (cumulative count 28806656)
99.904% <= 21.103 milliseconds (cumulative count 28808202)
99.909% <= 22.111 milliseconds (cumulative count 28809667)
99.915% <= 23.103 milliseconds (cumulative count 28811217)
99.920% <= 24.111 milliseconds (cumulative count 28812785)
99.924% <= 25.103 milliseconds (cumulative count 28814045)
99.927% <= 26.111 milliseconds (cumulative count 28814652)
99.928% <= 27.103 milliseconds (cumulative count 28815208)
99.931% <= 28.111 milliseconds (cumulative count 28815886)
99.934% <= 29.103 milliseconds (cumulative count 28816855)
99.937% <= 30.111 milliseconds (cumulative count 28817715)
99.938% <= 31.103 milliseconds (cumulative count 28818089)
99.941% <= 32.111 milliseconds (cumulative count 28818806)
99.942% <= 33.119 milliseconds (cumulative count 28819163)
99.943% <= 34.111 milliseconds (cumulative count 28819537)
99.945% <= 35.103 milliseconds (cumulative count 28819993)
99.947% <= 36.127 milliseconds (cumulative count 28820423)
99.948% <= 37.119 milliseconds (cumulative count 28820779)
99.949% <= 38.111 milliseconds (cumulative count 28821103)
99.950% <= 39.103 milliseconds (cumulative count 28821474)
99.952% <= 40.127 milliseconds (cumulative count 28821987)
99.953% <= 41.119 milliseconds (cumulative count 28822343)
99.954% <= 42.111 milliseconds (cumulative count 28822696)
99.955% <= 43.103 milliseconds (cumulative count 28822950)
99.956% <= 44.127 milliseconds (cumulative count 28823108)
99.957% <= 45.119 milliseconds (cumulative count 28823351)
99.957% <= 46.111 milliseconds (cumulative count 28823537)
99.958% <= 47.103 milliseconds (cumulative count 28823708)
99.959% <= 48.127 milliseconds (cumulative count 28823944)
99.959% <= 49.119 milliseconds (cumulative count 28824139)
99.960% <= 50.111 milliseconds (cumulative count 28824321)
99.961% <= 51.103 milliseconds (cumulative count 28824450)
99.961% <= 52.127 milliseconds (cumulative count 28824569)
99.961% <= 53.119 milliseconds (cumulative count 28824654)
99.962% <= 54.111 milliseconds (cumulative count 28824747)
99.962% <= 55.103 milliseconds (cumulative count 28824884)
99.962% <= 56.127 milliseconds (cumulative count 28825020)
99.963% <= 57.119 milliseconds (cumulative count 28825140)
99.963% <= 58.111 milliseconds (cumulative count 28825226)
99.963% <= 59.103 milliseconds (cumulative count 28825291)
99.964% <= 60.127 milliseconds (cumulative count 28825339)
99.964% <= 61.119 milliseconds (cumulative count 28825374)
99.964% <= 62.111 milliseconds (cumulative count 28825416)
99.964% <= 63.103 milliseconds (cumulative count 28825418)
99.964% <= 64.127 milliseconds (cumulative count 28825461)
99.964% <= 65.119 milliseconds (cumulative count 28825536)
99.964% <= 66.111 milliseconds (cumulative count 28825539)
99.964% <= 68.159 milliseconds (cumulative count 28825546)
99.964% <= 69.119 milliseconds (cumulative count 28825578)
99.965% <= 70.143 milliseconds (cumulative count 28825689)
99.966% <= 71.103 milliseconds (cumulative count 28826077)
99.968% <= 72.127 milliseconds (cumulative count 28826584)
99.968% <= 73.151 milliseconds (cumulative count 28826644)
99.968% <= 74.111 milliseconds (cumulative count 28826689)
99.969% <= 78.143 milliseconds (cumulative count 28826759)
99.969% <= 79.103 milliseconds (cumulative count 28826836)
99.969% <= 80.127 milliseconds (cumulative count 28826851)
99.970% <= 81.151 milliseconds (cumulative count 28827090)
99.972% <= 82.111 milliseconds (cumulative count 28827653)
99.972% <= 83.135 milliseconds (cumulative count 28827895)
99.974% <= 84.159 milliseconds (cumulative count 28828266)
99.975% <= 85.119 milliseconds (cumulative count 28828625)
99.976% <= 86.143 milliseconds (cumulative count 28828964)
99.977% <= 87.103 milliseconds (cumulative count 28829125)
99.977% <= 88.127 milliseconds (cumulative count 28829139)
99.977% <= 89.151 milliseconds (cumulative count 28829188)
99.977% <= 90.111 milliseconds (cumulative count 28829228)
99.977% <= 91.135 milliseconds (cumulative count 28829239)
99.977% <= 95.103 milliseconds (cumulative count 28829264)
99.978% <= 96.127 milliseconds (cumulative count 28829490)
99.980% <= 97.151 milliseconds (cumulative count 28829945)
99.981% <= 98.111 milliseconds (cumulative count 28830250)
99.981% <= 99.135 milliseconds (cumulative count 28830377)
99.981% <= 100.159 milliseconds (cumulative count 28830484)
99.982% <= 101.119 milliseconds (cumulative count 28830544)
99.982% <= 102.143 milliseconds (cumulative count 28830578)
99.982% <= 103.103 milliseconds (cumulative count 28830589)
99.982% <= 108.159 milliseconds (cumulative count 28830623)
99.982% <= 109.119 milliseconds (cumulative count 28830639)
99.982% <= 117.119 milliseconds (cumulative count 28830643)
99.982% <= 118.143 milliseconds (cumulative count 28830665)
99.982% <= 119.103 milliseconds (cumulative count 28830680)
99.982% <= 120.127 milliseconds (cumulative count 28830689)
99.982% <= 125.119 milliseconds (cumulative count 28830707)
99.982% <= 126.143 milliseconds (cumulative count 28830789)
99.983% <= 127.103 milliseconds (cumulative count 28830856)
99.983% <= 128.127 milliseconds (cumulative count 28830992)
99.984% <= 129.151 milliseconds (cumulative count 28831160)
99.984% <= 130.111 milliseconds (cumulative count 28831314)
99.985% <= 131.199 milliseconds (cumulative count 28831446)
99.985% <= 132.223 milliseconds (cumulative count 28831488)
99.985% <= 133.119 milliseconds (cumulative count 28831525)
99.985% <= 134.143 milliseconds (cumulative count 28831539)
99.985% <= 144.127 milliseconds (cumulative count 28831553)
99.985% <= 145.151 milliseconds (cumulative count 28831644)
99.986% <= 146.175 milliseconds (cumulative count 28831688)
99.986% <= 147.199 milliseconds (cumulative count 28831689)
99.986% <= 148.223 milliseconds (cumulative count 28831734)
99.986% <= 149.119 milliseconds (cumulative count 28831778)
99.986% <= 150.143 milliseconds (cumulative count 28831789)
99.986% <= 151.167 milliseconds (cumulative count 28831832)
99.986% <= 152.191 milliseconds (cumulative count 28831839)
99.986% <= 159.103 milliseconds (cumulative count 28831853)
99.986% <= 160.127 milliseconds (cumulative count 28831877)
99.986% <= 163.199 milliseconds (cumulative count 28831889)
99.986% <= 170.111 milliseconds (cumulative count 28831901)
99.986% <= 171.135 milliseconds (cumulative count 28831923)
99.986% <= 172.159 milliseconds (cumulative count 28831939)
99.987% <= 177.151 milliseconds (cumulative count 28831975)
99.987% <= 178.175 milliseconds (cumulative count 28831989)
99.987% <= 185.215 milliseconds (cumulative count 28832011)
99.987% <= 186.111 milliseconds (cumulative count 28832071)
99.987% <= 187.135 milliseconds (cumulative count 28832089)
99.987% <= 190.207 milliseconds (cumulative count 28832125)
99.987% <= 191.103 milliseconds (cumulative count 28832139)
99.987% <= 192.127 milliseconds (cumulative count 28832229)
99.988% <= 193.151 milliseconds (cumulative count 28832239)
99.988% <= 196.223 milliseconds (cumulative count 28832262)
99.988% <= 197.119 milliseconds (cumulative count 28832289)
99.988% <= 200.191 milliseconds (cumulative count 28832317)
99.988% <= 201.215 milliseconds (cumulative count 28832349)
99.988% <= 202.111 milliseconds (cumulative count 28832444)
99.988% <= 203.135 milliseconds (cumulative count 28832489)
99.988% <= 204.159 milliseconds (cumulative count 28832493)
99.989% <= 205.183 milliseconds (cumulative count 28832547)
99.989% <= 206.207 milliseconds (cumulative count 28832603)
99.989% <= 207.103 milliseconds (cumulative count 28832625)
99.989% <= 208.127 milliseconds (cumulative count 28832639)
99.989% <= 209.151 milliseconds (cumulative count 28832641)
99.989% <= 210.175 milliseconds (cumulative count 28832687)
99.989% <= 211.199 milliseconds (cumulative count 28832752)
99.989% <= 212.223 milliseconds (cumulative count 28832784)
99.989% <= 213.119 milliseconds (cumulative count 28832789)
99.989% <= 214.143 milliseconds (cumulative count 28832799)
99.990% <= 215.167 milliseconds (cumulative count 28832827)
99.990% <= 216.191 milliseconds (cumulative count 28832865)
99.990% <= 217.215 milliseconds (cumulative count 28832889)
99.990% <= 221.183 milliseconds (cumulative count 28832947)
99.991% <= 222.207 milliseconds (cumulative count 28833125)
99.991% <= 223.103 milliseconds (cumulative count 28833255)
99.992% <= 224.127 milliseconds (cumulative count 28833434)
99.992% <= 225.151 milliseconds (cumulative count 28833646)
99.993% <= 226.175 milliseconds (cumulative count 28833689)
99.993% <= 228.223 milliseconds (cumulative count 28833761)
99.993% <= 229.119 milliseconds (cumulative count 28833822)
99.993% <= 230.143 milliseconds (cumulative count 28833939)
99.994% <= 241.151 milliseconds (cumulative count 28833980)
99.994% <= 242.175 milliseconds (cumulative count 28833989)
99.994% <= 247.167 milliseconds (cumulative count 28834019)
99.994% <= 248.191 milliseconds (cumulative count 28834039)
99.994% <= 256.127 milliseconds (cumulative count 28834124)
99.995% <= 257.151 milliseconds (cumulative count 28834273)
99.995% <= 258.175 milliseconds (cumulative count 28834472)
99.995% <= 259.199 milliseconds (cumulative count 28834530)
99.995% <= 260.223 milliseconds (cumulative count 28834539)
99.996% <= 262.143 milliseconds (cumulative count 28834574)
99.996% <= 263.167 milliseconds (cumulative count 28834589)
99.996% <= 266.239 milliseconds (cumulative count 28834620)
99.996% <= 267.263 milliseconds (cumulative count 28834639)
99.996% <= 279.295 milliseconds (cumulative count 28834654)
99.996% <= 280.319 milliseconds (cumulative count 28834689)
99.996% <= 281.343 milliseconds (cumulative count 28834724)
99.996% <= 282.111 milliseconds (cumulative count 28834775)
99.996% <= 283.135 milliseconds (cumulative count 28834789)
99.996% <= 295.167 milliseconds (cumulative count 28834790)
99.996% <= 337.151 milliseconds (cumulative count 28834791)
99.996% <= 446.207 milliseconds (cumulative count 28834807)
99.997% <= 447.231 milliseconds (cumulative count 28834841)
99.997% <= 448.255 milliseconds (cumulative count 28834890)
99.997% <= 449.279 milliseconds (cumulative count 28834891)
99.997% <= 452.351 milliseconds (cumulative count 28834892)
99.997% <= 453.119 milliseconds (cumulative count 28834920)
99.997% <= 454.143 milliseconds (cumulative count 28834941)
99.997% <= 456.191 milliseconds (cumulative count 28835008)
99.997% <= 457.215 milliseconds (cumulative count 28835057)
99.997% <= 458.239 milliseconds (cumulative count 28835084)
99.997% <= 459.263 milliseconds (cumulative count 28835108)
99.998% <= 460.287 milliseconds (cumulative count 28835186)
99.998% <= 461.311 milliseconds (cumulative count 28835249)
99.998% <= 462.335 milliseconds (cumulative count 28835290)
99.998% <= 463.103 milliseconds (cumulative count 28835291)
99.998% <= 492.287 milliseconds (cumulative count 28835304)
99.998% <= 493.311 milliseconds (cumulative count 28835367)
99.998% <= 494.335 milliseconds (cumulative count 28835391)
99.999% <= 496.127 milliseconds (cumulative count 28835429)
99.999% <= 497.151 milliseconds (cumulative count 28835441)
99.999% <= 502.271 milliseconds (cumulative count 28835472)
99.999% <= 503.295 milliseconds (cumulative count 28835491)
99.999% <= 504.319 milliseconds (cumulative count 28835526)
99.999% <= 505.343 milliseconds (cumulative count 28835541)
99.999% <= 508.159 milliseconds (cumulative count 28835576)
99.999% <= 509.183 milliseconds (cumulative count 28835591)
99.999% <= 510.207 milliseconds (cumulative count 28835624)
99.999% <= 511.231 milliseconds (cumulative count 28835641)
99.999% <= 629.247 milliseconds (cumulative count 28835653)
99.999% <= 630.271 milliseconds (cumulative count 28835681)
99.999% <= 631.295 milliseconds (cumulative count 28835690)
99.999% <= 1054.719 milliseconds (cumulative count 28835691)
100.000% <= 1055.743 milliseconds (cumulative count 28835735)
100.000% <= 1056.767 milliseconds (cumulative count 28835740)
100.000% <= 6688.767 milliseconds (cumulative count 28835767)
100.000% <= 6742.015 milliseconds (cumulative count 28835790)
100.000% <= 6922.239 milliseconds (cumulative count 28835799)
100.000% <= 6926.335 milliseconds (cumulative count 28835840)
100.000% <= 6926.335 milliseconds (cumulative count 28835840)
100.000% <= 6926.335 milliseconds (cumulative count 28835840)
[...]

Summary:
  throughput summary: 46177.46 requests per second
  latency summary (msec):
          avg       min       p50       p95       p99       max
        0.964     0.136     0.815     1.399     1.751  6926.335